results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN/50M-KEYS/8/batchsize-2048/ycsbwklda/Vanilla.out
RocksDB:    version 5.4
Date:       Thu Mar 14 01:05:37 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwklda    :      17.280 micros/op 57869 ops/sec; ( reads:732101 writes:729898 total:50000000 found:732101)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwklda --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 177.01
	System time (seconds): 192.38
	Percent of CPU this job got: 179%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:25.49
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 1900720
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 72
	Minor (reclaiming a frame) page faults: 6958316
	Voluntary context switches: 7251125
	Involuntary context switches: 1616
	Swaps: 0
	File system inputs: 39768152
	File system outputs: 299909208
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[171600.920146] sh (90509): drop_caches: 3
[171600.957216] sh (90517): drop_caches: 3
[171606.006840] sh (90525): drop_caches: 3
[171606.043397] sh (90532): drop_caches: 3
[171613.817794] sh (91027): drop_caches: 3
[171613.896778] sh (91034): drop_caches: 3
[171618.946480] sh (91046): drop_caches: 3
[171618.991833] sh (91053): drop_caches: 3
[171653.517980] sh (91129): drop_caches: 3
[171653.562925] sh (91136): drop_caches: 3
[171658.608516] sh (91144): drop_caches: 3
[171658.652701] sh (91151): drop_caches: 3
[171666.440456] sh (91646): drop_caches: 3
[171666.523046] sh (91653): drop_caches: 3
[171671.571411] sh (91661): drop_caches: 3
[171671.616733] sh (91668): drop_caches: 3